In [4]:
import pandas as pd

In [5]:
customers_df = pd.read_csv("C:/Users/shanz/UE_DAB_2025/DAB_2025_Workshops/customers_wk9_thurs.csv")
products_df = pd.read_csv("C:/Users/shanz/UE_DAB_2025/DAB_2025_Workshops/products_wk9_thurs.csv")
sales_df = pd.read_csv("C:/Users/shanz/UE_DAB_2025/DAB_2025_Workshops/sales_wk9_thurs.csv")

In [6]:
customers_df.head()

,customer_id,first_name,last_name,age,state,income,registration_date,email
0,1,John,Smith,34,CA,75000,2022-01-15,john.smith@email.com
1,2,Sarah,Johnson,28,NY,82000,2022-01-22,sarah.johnson@email.com
2,3,Michael,Brown,45,TX,95000,2022-02-03,michael.brown@email.com
3,4,Emily,Davis,31,FL,68000,2022-02-14,emily.davis@email.com
4,5,David,Wilson,52,IL,110000,2022-02-28,david.wilson@email.com

In [7]:
products_df.head()

,product_id,product_name,category,price,launch_date,brand
0,1,Wireless Bluetooth Headphones,Electronics,79.99,2021-03-15,AudioTech
1,2,Organic Cotton T-Shirt,Clothing,24.99,2021-04-20,EcoWear
2,3,Stainless Steel Water Bottle,Home & Garden,19.99,2021-05-10,HydroLife
3,4,Leather Crossbody Bag,Accessories,89.99,2021-06-01,StyleCraft
4,5,Yoga Mat Premium,Sports & Outdoors,34.99,2021-06-15,FitZone

In [8]:
sales_df.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount
0,1,1,1,2022-02-10 14:30:00,1,79.99
1,2,2,3,2022-02-15 10:15:00,2,39.98
2,3,3,5,2022-02-20 16:45:00,1,34.99
3,4,4,2,2022-02-25 11:20:00,3,74.97
4,5,5,4,2022-03-01 13:10:00,1,89.99

In [9]:
customers_df['registration_date'] = pd.to_datetime(customers_df['registration_date'])

In [10]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        100 non-null    int64
 1   first_name         100 non-null    object
 2   last_name          100 non-null    object
 3   age                100 non-null    int64
 4   state              100 non-null    object
 5   income             100 non-null    int64
 6   registration_date  100 non-null    datetime64[ns]
 7   email              100 non-null    object
dtypes: datetime64[ns](1), int64(3), object(4)
memory usage: 6.4+ KB

In [11]:
products_df['launch_date'] = pd.to_datetime(products_df['launch_date'])

In [12]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    60 non-null     int64
 1   product_name  60 non-null     object
 2   category      60 non-null     object
 3   price         60 non-null     float64
 4   launch_date   60 non-null     datetime64[ns]
 5   brand         60 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.9+ KB

In [13]:
sales_df['transaction_date'] = pd.to_datetime(sales_df['transaction_date'])

In [14]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   sale_id           150 non-null    int64
 1   customer_id       150 non-null    int64
 2   product_id        150 non-null    int64
 3   transaction_date  150 non-null    datetime64[ns]
 4   quantity          150 non-null    int64
 5   total_amount      150 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(4)
memory usage: 7.2 KB

In [15]:
#Extract useful components from the sales transaction dates: year, month, and day of week
sales_df['year'] = sales_df['transaction_date'].dt.year

In [16]:
sales_df

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,year
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022
...,...,...,...,...,...,...,...
145,146,86,30,2024-02-15 15:20:00,1,34.99,2024
146,147,87,32,2024-02-20 11:30:00,3,83.97,2024
147,148,88,34,2024-02-25 13:45:00,2,109.98,2024
148,149,89,36,2024-03-01 16:15:00,1,29.99,2024
149,150,90,38,2024-03-05 10:30:00,4,139.96,2024

In [17]:
# 1. Fix the Year column (it likely got overwritten)
sales_df['year'] = sales_df['transaction_date'].dt.year

# 2. Ensure the Month column is correct
sales_df['month'] = sales_df['transaction_date'].dt.month

# 3. Add the Day of Week column (the final part of your task)
sales_df['day_of_week'] = sales_df['transaction_date'].dt.day_name()

In [18]:
sales_df

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,year,month,day_of_week
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,Thursday
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,Tuesday
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,Sunday
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,Friday
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,Tuesday
...,...,...,...,...,...,...,...,...,...
145,146,86,30,2024-02-15 15:20:00,1,34.99,2024,2,Thursday
146,147,87,32,2024-02-20 11:30:00,3,83.97,2024,2,Tuesday
147,148,88,34,2024-02-25 13:45:00,2,109.98,2024,2,Sunday
148,149,89,36,2024-03-01 16:15:00,1,29.99,2024,3,Friday
149,150,90,38,2024-03-05 10:30:00,4,139.96,2024,3,Tuesday

In [19]:
#Display the date range covered by your sales data (earliest and latest dates)
earliest_date = sales_df['transaction_date'].min()
latest_date = sales_df['transaction_date'].max()

In [20]:
print(f"earliest_date :{earliest_date}")

earliest_date :2022-02-10 14:30:00

In [21]:
print(f"latest_date :{latest_date}")

latest_date :2024-03-05 10:30:00

In [22]:
#Find the busiest day of the week for sales (by counting transactions)
sales_df['day_of_week'] = sales_df['transaction_date'].dt.day_name()

In [23]:
day_counts = sales_df['day_of_week'].value_counts()

In [24]:
print(day_counts)

day_of_week
Friday       24
Tuesday      22
Thursday     21
Sunday       21
Saturday     21
Wednesday    21
Monday       20
Name: count, dtype: int64

In [25]:
busiest_day = day_counts.idxmax()
max_sales = day_counts.max()

In [26]:
print(f"The busiest day for sales is {busiest_day} with {max_sales} transactions.")

The busiest day for sales is Friday with 24 transactions.

In [27]:
#Determine which month had the most transactions
month_counts = sales_df['month'].value_counts()

In [28]:
busiest_month = month_counts.idxmax()

In [29]:
max_month_transactions = month_counts.max()
print(f"The busiest month is month {busiest_month} with {max_month_transactions} transactions.")

The busiest month is month 2 with 16 transactions.

In [30]:
#Count how many sales happened in each year
year_counts = sales_df['year'].value_counts()

In [31]:
print(year_counts)

year
2023    72
2022    65
2024    13
Name: count, dtype: int64

## Part 2: GroupBy and Aggregation

In [32]:
#Group products by category and calculate the average price for each category
category_averages = products_df.groupby('category')['price'].mean()

In [33]:
print(category_averages)

category
Accessories           35.073333
Clothing              52.240000
Electronics           59.990000
Home & Garden         30.156667
Sports & Outdoors    105.899091
Name: price, dtype: float64

In [34]:
#Count how many products are in each category
category_counts = products_df['category'].value_counts()
print(category_counts)

category
Electronics          13
Clothing             12
Home & Garden        12
Accessories          12
Sports & Outdoors    11
Name: count, dtype: int64

In [35]:
#Group customers by state and find the average age in each state
customers_by_state = customers_df.groupby('state')['age'].mean()

In [36]:
print(customers_by_state)

state
CA    34.10
FL    39.00
IL    37.25
NY    36.50
TX    38.30
Name: age, dtype: float64

In [37]:
#Calculate total spending per customer (sum up all their purchases)
customer_spending = sales_df.groupby('sale_id')['total_amount'].sum()

In [38]:
print(customer_spending.sort_values(ascending=False).head())

sale_id
144    319.98
73     299.98
122    269.97
41     249.99
90     249.99
Name: total_amount, dtype: float64

In [39]:
#Find customers who have made the most purchases
most_purchases = sales_df['customer_id'].value_counts()

In [40]:
print(most_purchases.head())

customer_id
1    2
2    2
3    2
4    2
5    2
Name: count, dtype: int64

In [41]:
#Calculate total sales revenue by month
monthly_revenue = sales_df.groupby('month')['total_amount'].sum()

In [42]:
print(monthly_revenue)

month
1      864.79
2     1669.66
3     1115.77
4      924.77
5     1177.79
6      986.68
7      930.80
8      870.74
9     1150.76
10    1235.80
11    1022.76
12    1458.71
Name: total_amount, dtype: float64

In [43]:
#Find the average transaction amount by day of the week
sales_df['day_of_week'] = sales_df['transaction_date'].dt.day_name()

In [44]:
avg_spend_day = sales_df.groupby('day_of_week')['total_amount'].mean()
print(avg_spend_day)

day_of_week
Friday       100.940833
Monday        90.927500
Saturday      61.121905
Sunday        99.551429
Thursday     102.267619
Tuesday       74.028636
Wednesday     96.071905
Name: total_amount, dtype: float64

In [45]:
#Determine which product category generates the most total revenue
merged_df = sales_df.merge(products_df, on='product_id')

In [46]:
category_revenue = merged_df.groupby('category')['total_amount'].sum()

In [47]:
top_category = category_revenue.idxmax()
highest_revenue = category_revenue.max()
print(f"The top category is {top_category} with ${highest_revenue:,.2f} in total revenue.")

The top category is Sports & Outdoors with $3,544.64 in total revenue.

In [48]:
#Find which state has the most customers
state_count = customers_df['state'].value_counts()

In [49]:
top_state = state_count.idxmax
customer_total = state_count.max()

In [50]:
print(f" the state with most customers is {top_state} with {customer_total} customers.")

 the state with most customers is <bound method Series.idxmax of state
CA    20
NY    20
TX    20
FL    20
IL    20
Name: count, dtype: int64> with 20 customers.

In [51]:
#Identify the top 5 customers by total spending
spending_by_id = sales_df.groupby('customer_id')['total_amount'].sum()

In [52]:
top_customers = pd.merge(spending_by_id, customers_df, on='customer_id')

In [53]:
top_5_spenders = top_customers.sort_values(by= 'total_amount', ascending=False).head(6)

In [54]:
print(top_5_spenders[['first_name', 'last_name', 'total_amount']])

   first_name last_name  total_amount
30     Daniel  Gonzalez        379.97
12    Matthew    Harris        359.96
40     Joseph     Evans        329.98
83     Janice  Gonzales        319.98
29   Kimberly     Baker        284.98
55      Janet      Ward        279.98

In [55]:
#Determine which day of the week has the highest average transaction value
sales_df['day_of_week'] = sales_df['transaction_date'].dt.day_name()
avg_transaction_value = sales_df.groupby('day_of_week')['total_amount'].mean()

In [56]:
highest_avg_day = (avg_transaction_value.sort_values(ascending=False))

In [57]:
print(highest_avg_day)

day_of_week
Thursday     102.267619
Friday       100.940833
Sunday        99.551429
Wednesday     96.071905
Monday        90.927500
Tuesday       74.028636
Saturday      61.121905
Name: total_amount, dtype: float64

In [58]:
#How can extracting day of the week and month from dates help a retail business make better decisions?
#Extracting the day and month from your sales data is like having a "crystal ball" for your business. 
##Instead of guessing, you can see exactly when people like to shop. 
#For example, knowing that Saturdays are your busiest days means you can make sure you have enough staff working so customers don't have to wait in long lines. 
#On the other hand, knowing which months are the slowest helps you plan big sales or discounts to bring people back into the store. By looking at these patterns, you can save money on labor, keep the right items in stock, 
#and make sure you’re spending your marketing budget at the right time

In [59]:
#Why is it useful to group data by categories, states, or time periods rather than looking at individual transactions?
#1.Grouping data by categories, states, or time periods is essential because it transforms overwhelming piles of individual receipts into
#actionabale insights
#2.While a single transaction only tells you what one person did at one specific moment, grouping reveals the broader patterns and "hidden stories" that actually drive your success. 
#3.By aggregating this information, you can see which product types are your real money-makers, which geographic regions deserve more advertising budget, and whether your sales are steadily growing or just spiking due to random luck

In [60]:
#Based on your findings, what simple recommendations would you give to help the retail chain improve their performance?
#1. Based on our findings, the retail chain should first double down on marketing in high-performing states like New York while running clearance sales for low-volume categories to free up valuable shelf space.
#2. Secondly, they should optimize labor costs by scheduling their most experienced sales staff on the specific day of the week (often Saturday), when the average transaction value is highest.
#3.Future slumps can be predicted , the business can proactively launch targeted promotions to maintain a steady cash flow throughout the entire year.